A Pandas dataframe has multiple columns and rows and contains a named index
---

In [5]:
import pandas as pd
import numpy as np

In [10]:
from numpy.random import randn

np.random.seed(101)
random_matrix = randn(5,4)
random_matrix

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [29]:
df = pd.DataFrame(data = random_matrix, index = 'A B C D E'.split(), columns = 'W X Y Z'.split()) # Automatically formats the data into rows and columns and applies a set of indexes

In [35]:
# Done in two steps - commonly done in one

mylist = ['W', 'Y'] # Just a list being passed into brackets
df[mylist]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [38]:
# Don't use the dot as this can cause conflicts with inbuilt Pandas methods

df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [45]:
# Creating a new column - you simple act as if a column already existed and assign it some values

mylist = [['W', 'Y']]
df['New'] = df['W'] + df['Y']
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [54]:
#df.drop('New') # By default set to rows not columns
# df.drop('New', axis=1)
# df

In [56]:
# df.drop('New', axis=1, inplace=True)
# df

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Shift focus to rows

In [58]:
df.drop('A') # not occuring in place.

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Selecting Rows - There are two ways
---

df.loc['name']

df.iloc['index']

In [59]:
# Select Rows A and E

df.loc[['A', 'E']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df.iloc[[0,4], [0,1,2,3]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [67]:
# Let's grab A and B rows and colums Y and Z

df.loc[['A', 'B'], ['Y', 'Z']] # Reference by Index Name

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [68]:
df.iloc[0:2, 2:4] # Referenced by Index / integer

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

Conditional Selection on a Dataframe
---

In [80]:
df_bool = df > 0 # this sets up a Boolean dataframe to use as a conditional filter

In [81]:
df[df_bool]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
# Or in one step

df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [85]:
# Let's get the rows back on column W based on a condition on the rows

df[df['W'] > 0] # by broadcasting across all columns you will return the conditional selection for all columns

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [88]:
df[df['W'] > 0]['Y'].loc['A'] # This is a stack of conditions but it becomes clearer over time

0.9079694464765431

In [89]:
# For two conditions of more

cond1 = df['W'] > 0
cond2 = df['Y'] > 1

In [94]:
df[(cond1) & (cond2)] # Need to use Ampersand

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [93]:
df[(cond1) | (cond2)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [96]:
# Or done as a single step

df[(df['W'] > 0) & (df['Y'] > 1)] # there are two series of boolean values and you check both to see what is true and provide a filtered result

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [97]:
df[(df['W'] > 0) | (df['Y'] > 1)] # there are two series of boolean values and you check both to see what is true and provide a filtered result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Setting and resetting indexes in Pandas
---

In [120]:
df.reset_index() # Index is just a default name - note it is not in place

  States         W         X         Y         Z
0     CA  2.706850  0.628133  0.907969  0.503826
1     NY  0.651118 -0.319318 -0.848077  0.605965
2     WY -2.018168  0.740122  0.528813 -0.589001
3     OR  0.188695 -0.758872 -0.933237  0.955057
4     CO  0.190794  1.978757  2.605967  0.683509

In [121]:
new_index = 'CA NY WY OR CO'.split()

In [122]:
df['States'] = new_index

In [123]:
df

               W         X         Y         Z States
States
CA      2.706850  0.628133  0.907969  0.503826     CA
NY      0.651118 -0.319318 -0.848077  0.605965     NY
WY     -2.018168  0.740122  0.528813 -0.589001     WY
OR      0.188695 -0.758872 -0.933237  0.955057     OR
CO      0.190794  1.978757  2.605967  0.683509     CO

In [124]:
df

               W         X         Y         Z States
States
CA      2.706850  0.628133  0.907969  0.503826     CA
NY      0.651118 -0.319318 -0.848077  0.605965     NY
WY     -2.018168  0.740122  0.528813 -0.589001     WY
OR      0.188695 -0.758872 -0.933237  0.955057     OR
CO      0.190794  1.978757  2.605967  0.683509     CO

Other Pandas Operations
---

In [126]:
df.info

<bound method DataFrame.info of                W         X         Y         Z States
States
CA      2.706850  0.628133  0.907969  0.503826     CA
NY      0.651118 -0.319318 -0.848077  0.605965     NY
WY     -2.018168  0.740122  0.528813 -0.589001     WY
OR      0.188695 -0.758872 -0.933237  0.955057     OR
CO      0.190794  1.978757  2.605967  0.683509     CO>

In [129]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [130]:
df.shape

(5, 5)

In [131]:
df.columns

Index(['W', 'X', 'Y', 'Z', 'States'], dtype='object')

In [135]:
df['W'] > 0

States
CA     True
NY     True
WY    False
OR     True
CO     True
Name: W, dtype: bool

In [137]:
df[df['W'] > 0]

               W         X         Y         Z States
States
CA      2.706850  0.628133  0.907969  0.503826     CA
NY      0.651118 -0.319318 -0.848077  0.605965     NY
OR      0.188695 -0.758872 -0.933237  0.955057     OR
CO      0.190794  1.978757  2.605967  0.683509     CO

In [138]:
ser_w = df['W'] > 0

In [142]:
ser_w.value_counts()

True     4
False    1
Name: W, dtype: int64

In [143]:
sum(ser_w)

4

In [144]:
len(ser_w)

5

In [145]:
len(ser_w) - sum(ser_w)

1